#შექმენით 4 სხვადასხვა ფუნქცია ერთი მიმატების მეორე გამოკლების მესამე გამრავლების მეოთხე გაყოფის, თითოეულ ფუნქციაში უნდა მოხდეს შესაბამისი მოქმედება ორ რიცხვს შორის, მაგ. მეტობის ფუნქციაში უნად დაიბეჭდოს ნებისმიერი ორი რიცხვის ჯამი, გამრავლების ფუნქციაში ნებისმიერი ორი რიცხვი ნამრავლი და ასე შემდეგ საბოლოოდ გამოიძხეთ ყველა ფუნქცია


def მიმატება():
    print(1 + 1)

მიმატება()


def გამოკლება():
    print(25 - 5)

გამოკლება()


def გამრავლება():
    print(4 * 4)

გამრავლება()


def გაყოფა():
    print(25 / 5)
 
გაყოფა()