/*1)შექმენით ერთი სეტი სადაც მოათავსებთ რამდენიმე ელემენტს(ერთნაირი ელემენტები მეორდებოდეს რამდენჯერმე)

შენი დავალებაა რომ სეტში დაამატო რამდენიმე განსხვავებული ელემენტი(გამოიყენე CHAIN + მეთოდი)

შემდეგ ამოშალე ის ელემენტი სეტიდან რომელიც პირველია სეტში

შემდეგ შეამოწმე არის თუ არა თქვენთვის სასურველი ელემენტი სეტში

შემდეგ კონსოლში გამოიტანე სეტის სიგრძე

შემდეგ შექმენი ცვლადი და გამოიყენე ENTRIES მეთოდი სეტზე,ამის შემდეგ გადაუარე FOREACH ით და გამოიტანე წყვილად(სიებად)

ამის შემდეგ გაასუფთავეთ მთლიანი სეტი*/

let set = new Set(["one", "two", "three", "four", "five"]);

set.add("six").add("seven");

console.log(set);

let has = set.has("one");
console.log(has);

console.log("zoma:", set.size);


let entries = set.entries();

entries.forEach((value) => {
    console.log(value);
});


set.clear();

console.log(set);