//შექმენით 5 სათაური,შენი დავალებაა რომ ეს 5 სათაური წამოიღო ჯს ში tagName ის გამოყენებით და შეინახო ცვლადში,შემდეგ შენი დავალებაა რომ innerHTNL ის გამოყენებით შეცვალალო ყველა სათაურის შიგთავსი(ტექსტი) ცალ ცალკე(ინდექსების გამოყენებით რითიც თქვენ გინდათ, ამის შემდეგ როცა შეცვლით 5 ივე ს კონტენტს გამოიტანეთ 5 ივე სათაურის შიგთავსი კონსოლში გამოიყენეთ  innerHTML
let h1 = document.getElementsByTagName("h1");
h1[0].innerHTML = "ggg";
h1[1].innerHTML = "ggg";
h1[2].innerHTML = "ggg";
h1[3].innerHTML = "ggg";
h1[4].innerHTML = "ggg";

console.log(h1);