#a = 5
#b = "10"
#result = a + b
#print("Result:",result)
#ტერმინალში ერორს გამოიტანს რადგან პრინტის ფრჩხილებში ორჯერაა result-ი და ორივე განსხვავებულია 
#ერთს აქვს ბრჭყალები მეორეს არ აქვს.როცა სტრინგ ტიპის ცვლადს ვქმნით ჯერ ვიწყებთ ცვლადის დასახელებით
#შემდეგ ვწერთ ტოლობას და ტოლობის შემდეგ ვწერთ სტრინგს ოღონდ ბრჭყალებში.და ამ ცვლადის გამოსატანად
#ვწერთ print-ს შემდეგ ფრჩხილებს,ფრჩხილებშ ვწერთ ჩვენ შქმნილ სტრინგ ტიპის ცვლადის სახელწოდებას.


#ზემოთ მოცემულ result-ის მაგალითში ფრჩხილებში იქნება მხოლოდ result-ი ოღონდ გვჭირდება
#b-ის გაინტეჯერება

a = 5
b = "10"
result = a + int(b)
print(result)

