//შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგების სია,სადაც მოთავსებული იქნება 10 სტრინგი,შენი დავალებაა რომ -->---გაიგო ამ სიის სიგრძე--გამოიტანო მე3 ინდექსიდან მე8 ინდექსამდე ელემენტები---გამოიტანო მე 4 ე ინდექსიდან 3 ელემენტი

function func(list) {
    console.log(list.length);

    let list1 = list.slice(4 , 8);
    console.log(list1);


    let list2 = list.splice(4, 3);
    console.log(list2);
}

let myList = ["ერთი", "ორი", "სამი", "ოთხი", "ხუთი", "ექვსი", "შვიდი", "რვა", "ცხრა", "ათი"];

func(myList);
