//ფუნქციამ მიიღოს რიცხვი(პარამეტრი) , while loop ის გამოყენებით შენი დავა;ებაა 1 დან პარამეტრშ გადაცემულ რიცხვამდე დაითვალო ყველა კენტი რიცხვის და ასევე ყველა ლუწი რიცხვის რაოდენობა ცალ ცალკე,გამოიძახე ფუნქცია რამდენჯერმე გადაეცი განსხვავებული მნიშვნელობები.

function func(num){
    let i = 1;  
    let kent = 0;
    let luw = 0;

    while (i <= num){
        if (i % 2 === 0){
            kent +=1;
        } else {
            luw +=1;
        }
        i +=1 ;
    }

    console.log(kent);
    console.log(luw);
    
}

func(10);
func(20);
func(13);
