/*
მეთოდები:put,get,delete

put - ცვლის ძველ ინფორმაციას ბაზაში ახლით.
delete - შლის მონაცებს ბაზიდან.
get - ამატებს ბაზაში მონაცემებს.



პასუხის კოდები

200 - ნიშნავს რომ მოთხოვნა დაკმაყოფოლდა და მონაცემი შეინახა.
404 - ნიშნავს რომ მომხმარებლის მიერ შეყვანილი მონაცემი ვერ იქნა ნაპოვნი ბაზაში
400 - როცა მომხმარებელმა შეიყვანა რაიმე მონაცემი ბაზაში დავერ მოხდა მისი წაკითხვა.


სინქრონული კოდი იკითხება ზემოდან ქვემოთ თავის მიმდევრობით რასაც მიაქვს დრო.
ხოლო ასინქრომული კოდია სინქრონულის საპირისპირო.ამ დროს კოდი იკითხება ერთდროულად.
*/