for (let i = 0; i <= 100; i +=1) {
     if (i % 2 === 0) {
        console.log(i);
    }
}
for (let i = 0; i <= 100; i +=1) {
    if (i % 2 != 0) {
       console.log(i);
   }
    
}
for (let i = 0; i <= 100; i +=1) {
    if (i % 2 === 0) {
       console.log(i,"ლუწი");
   }
   else{
    console.log(i,"კენტი")
   }
    
}



//ბატონი გოგა ჩალაური — 22:17
//2)1 დან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი

//3)1 დან 100 მდე დაბეჭდეთ ყველა კენტი რიცხი

//4)1 დან 100 მდე დაბეჭდეთ ყველა რიცხვი მაგრამ თთოეულს მიუწერეთ გვერდით ლუწია თუ კენტი მაგ:

//1 კენტი
//2 ლუწი
//3 კენტი
//4 ლუწი