#შექმენით სია რომელშიც მოათვსებთ 10 განსხვავებულ მანქანის სახელს, შემდეგ დაბეჭდეთ ცალ ცალკე მეორე და მეხუთე ელემენტები,
# დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი, დაბეჭდეთ შუიდან ბოლომდე ყველა ელემენტი, დაბეჭდეთ მინუს 3 ინდექსზე და -1 
# ნდექსზე მდგომი ელემენტი, დაბეჭდეთ შუა სამი ელემენტი, დაბეჭდეთ მთლიანი სია


#10 განსხვავებული მანქანის სახელი
pr = ["c63", "camry", "vito", "corolla", "x-type", "370z", "e350", "gle53", "prius", "350z", "skyline"]

#დაბეჭდეთ მეორე და მეხუთე ელემენტები
print(pr[2])
print(pr[5])

#დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი
print(pr[0:6])


#დაბეჭდეთ შუიდან ბოლომდე ყველა ელემენტი
print(pr[5:11])



#დაბეჭდეთ მინუს 3 ინდექსზე და -1 ინდექსზე მდგომი ელემენტეი
print(pr[-1])
print(pr[-3])


#დაბეჭდეთ შუა სამი ელემენტი
print(pr[4:7])




#დაბეჭდეთ მთლიანი სია
print(pr)






#pr.append("ffff")
#print(len(pr))
#pr.remove("gio")
#print(pr[2])
#print.len()