#მომხამრებელს შემოატანინეთ ახლანდელი ასაკი ასევე შემოატანინეთ ახლანდელი წელი,
#შემდეგ შეეკითხეთ რამდენი წლით სურს დროში მოგზაურობა შემდეგ კი დაბეჭდეთ ერთ
#გრძელ წინადადებაში რამდენი წლის იქნება მომხარებელი დროში მოგზაურობის შემდეგ და 
#რომელი წელიწადი იქნება დროში მოგზაურობის შემდეგ

num = int(input("რა წელია დღეს"))


num1 = int(input("რამდენი წელი გსურთ მოგზაურობა"))

num2 = int(input("რომელი წელი იქნება დროშ მოგზაურობის შემდეგ"))

print(str(num) + "რა წელია დღეს" + str(2024 + num) + "რომდენი წელი გსურთ მოგზაურობა" + "რომელი წელი იქნება დროში მოგზაურობის შემდეგ")