# შექმენი სია სადაც დაამატებთ თქვენი ჯგუფელების სახელებს შემდეგ კი დაბეჭდეთ აურების მიხედვით "აურები ჩატში იქნება ჩაგდებული"

names = ["ნიკა დობორჯგინიძე 665", "თორნიკე ბერიძე 630", "გიორგი კაციტაძე 530", "გიორგი გუგავა 475", "ლაშ კაჭიური 455", "თორნიკე ხურცია 400",
        "გიორგი თედოზაშვილი 390", "ირაკლი ბუბუნაური 375", "თორნიკე ნებიერიძე 375", "საბა რუსეიშვილი 360", "ნიკა ტაბატაძე 350", "გვანცა კოპაძე 310"
        , "დიანა ძუკაევი 305", "ლაშაგიორგი 295", "ანასტასია ხახიაური 290", "გიორგი მოდებაძე 270", "ქეთევან მახარაშვილი 260", "ბექა ვარდუკაძე 260",
        "ალექსანდრე კეკოსვილი 220", "მარიამ შეყილაძე 210", "ლუკა გიგოშვილი 180", "გივიკო თუთარაშვილი 160", "ლუკა მიქუტიშვილი 160",
        "ნიკა გიგოშვილი 155", "თორნიკე ზუბია 150", "სოფო რატიანი 150", "ნიკა კარინთელი 145", "ჯეკო კურდოვანიძე 130", "ლუკა კელეპტრიშვილი 120",
        "ლუკა ბარამიძე 70"]

print(names)