//2)მომხმარებელს შემოატანინე რიამე რიცხვი 1იდან 10 მდე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის ლუწი,მაგ შემთხვევაში დაატრიალეთ ფორ ლუპი და ამ რიცხვიდან 50 მდე გამოიტანეთ ყველა ლუწი რიცხვი,და თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის კენტი,მაშინ დაატრიალეთ WHILE LOOP ამ რიცხვიდან 50 მდე და გამოიტანეთ ყველა კენტი რიცხვი

let num = Number(prompt("Enter a number"));

if (num < 1 || num > 10) {
    console.log("num is not in range 1-10");
} else {
    if (num % 2 !== 0) { 
        let i = 1;
        while (i <= 50) {
            if (i % 2 !== 0) {
                console.log(i);
            }
            i += 1;
        }
    } else { 
        for (let i = num; i < 50; i += 1) {
            if (i % 2 === 0) {
                console.log(i);
            }
        }
    }
}

console.log("You entered:", num);
