//3)მომხმარებელს შემოატანინეთ რიცხვი,შემდეგ დაატრუალეთ ფორ ციკლი 1 იდან მომხმარებლის მიერ შემოტანილ რიცხვამდე და იპოვე ამ რიცხვების საშუალო არითმეტიკული,შემდეგ შეამოწმეთ,თუ მიღებული საშვალო არის 20ზე მეტი ან ლუწი,მაშინ დააკონსოლლოგე რომ "good mark" შემდეგ შეამოწმეთ თ რს მიღებული საშვალო არის 20 ზე ნაკლები ან კენტი დაუკონსოლლოგეთ --> 'very bad mark"

let num = Number(prompt("enter num"));

for (let i = 1;i < num; i +=1){
    console.log(i);
}
let sum = (1 + num) /2;

if (sum > 20){
    console.log("good mark");
} else if (sum < 20){
    console.log("very bad mark");
}
