/*შექმენით ფრომისი რომელშიც

შექმნით ცვლადს სადაც იქნება შენახული რაიმე სახელი

შენი დავალებაა შეამოწმო თუ სახელი იწყება ასო "a" ზე ან ასო "g" ზე

მაშინ დაარესოლვე ფრომისი და რესოლვს გაატანე ის სახელი რაც ცვლადში გაქვს შენახული

სხვა შემთხვევაში დაარეჯექთე ფრომისი და ერორად გაატანე რაიმე ტექსტური ერორი

, შემდეგ გამოიძახე ეს ფრომისი ისე რომ რეჯექთის და რესოლვის შემთხვევაშიც გამოიტანოს ის მნიშვნელობები რაც ფრომისმა გამოგვატანა */

let pro = new Promise((res,rej)=>{
    let name = "gio";
    if(n.startsWith("a")|| n.startsWith("g")){
        res(name);
    } else{
        rej("error");
    }
});


pro.then((data)=>{
    console.log(data);
}, ((err)=>{
    console.log(err);
}));

